hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_efm.c
/*  Parameter validity check for bus state while flash program or erase. */
#define IS_VALID_EFM_BUS_STATE(state)                                          \
(       ((state) == EFM_BUS_BUSY)               ||                             \
        ((state) == EFM_BUS_RELEASE))

/*  Parameter validity check for efm data cache reset state. */
#define IS_VALID_EFM_CACHERST_STATE(state)                                     \
(       ((state) == EFM_CACHERST_ON)            ||                             \
        ((state) == EFM_CACHERST_OFF))

/*  Parameter validity check for efm instruction cache state. */
#define IS_VALID_EFM_INSCACHE_STATE(state)                                     \
(       ((state) == EFM_INSCACHE_ON)            ||                             \
        ((state) == EFM_INSCACHE_OFF))

/*  Parameter validity check for efm data cache state. */
#define IS_VALID_EFM_CACHEEN_STATE(state)                                      \
(       ((state) == EFM_CACHEEN_ON)             ||                             \
        ((state) == EFM_CACHEEN_OFF))

#define IS_VALID_EFM_ADDR(addr)                                                \
(       (((addr) == EFM_START_ADDR)             ||                             \
        ((addr) >= (EFM_START_ADDR + 1u)))      &&                             \
        ((addr) <= EFM_END_ADDR))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup EFM_Global_Functions EFM Global Functions
 * @{
 */

/**
 * @brief  EFM unlock.
 * @param  None
 * @retval None
 */
void EFM_Unlock(void)
{
    M0P_EFM->FAPRT = EFM_KEY1;
    M0P_EFM->FAPRT = EFM_KEY2;
}
/**
 * @brief  EFM Lock.
 * @param  None
 * @retval None
 */
void EFM_Lock(void)
{
    M0P_EFM->FAPRT = 0x00001111U;
}

/**
 * @brief  Enable or disable EFM.
 * @param  [in] enNewState                The function new state.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_Cmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    M0P_EFM->FSTP = ((Enable == enNewState) ? EFM_ON : EFM_OFF);
}

/**
 * @brief  Init efm config structure with default value.
 * @param  [in] pstcEfmCfg         The pointer of efm config structure.
 *   @arg u32Latency    Specifies the efm latency.
 *   @arg u32InsCache   Specifies the instruction cache on or off.
 *   @arg u32BusState   Specifies the bus state busy or release while program & erase.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t EFM_StrucInit(stc_efm_cfg_t *pstcEfmCfg)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcEfmCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcEfmCfg->u32Latency  = EFM_LATENCY_1;
        pstcEfmCfg->u32InsCache = EFM_INSCACHE_OFF;
        pstcEfmCfg->u32BusState = EFM_BUS_BUSY;
        pstcEfmCfg->u32CacheEn = EFM_CACHEEN_OFF;
    }

    return enRet;
}

/**
 * @brief  Efm Config.
 * @param  [in] pstcEfmCfg         The pointer of efm config structure.
 *   @arg u32Latency    Specifies the efm latency.
 *   @arg u32InsCache   Specifies the instruction cache on or off.
 *   @arg u32BusState   Specifies the bus state busy or release while program & erase.
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t EFM_Config(const stc_efm_cfg_t *pstcEfmCfg)
{
    en_result_t enRet = Ok;
    /* Check if pointer is NULL */
    if (NULL == pstcEfmCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Param valid check */
        DDL_ASSERT(IS_VALID_EFM_LATENCY(pstcEfmCfg->u32Latency));
        DDL_ASSERT(IS_VALID_EFM_BUS_STATE(pstcEfmCfg->u32BusState));
        DDL_ASSERT(IS_VALID_EFM_CACHERST_STATE(pstcEfmCfg->u32CacheRst));
        DDL_ASSERT(IS_VALID_EFM_INSCACHE_STATE(pstcEfmCfg->u32InsCache));
        DDL_ASSERT(IS_VALID_EFM_CACHEEN_STATE(pstcEfmCfg->u32CacheEn));

        /* Config efm. */
        MODIFY_REG32(M0P_EFM->FRMC, EFM_FRMC_FLWT | EFM_FRMC_CACHE | EFM_FRMC_PREFETE | EFM_FRMC_CRST0,
                pstcEfmCfg->u32Latency | pstcEfmCfg->u32CacheEn |
                pstcEfmCfg->u32InsCache | pstcEfmCfg->u32CacheRst);
        MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_BUSHLDCTL, pstcEfmCfg->u32BusState);
    }

    return enRet;
}

/**
 * @brief  Set the code latency value.
 * @param  [in] u32Latency              specifies the FLASH Latency value.
 *  This parameter can be one of the following values:
 *   @arg    EFM_LATENCY_0               FLASH 0 Latency cycle
 *   @arg    EFM_LATENCY_1               FLASH 1 Latency cycle
 * @retval None
 */
void EFM_SetLatency(uint32_t u32Latency)
{
    /* Param valid check */
    DDL_ASSERT(IS_VALID_EFM_LATENCY(u32Latency));

    /* Set the code latency value. */
    MODIFY_REG32(M0P_EFM->FRMC, EFM_FRMC_FLWT, u32Latency);
}

/**
 * @brief  Enable or disable the flash data cache reset.
 * @param  [in] enNewState                The new state of the flash data cache reset.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_DataCacheRstCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

