hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_efm.c
    if(Enable == enNewState)
    {
        SET_REG32_BIT(M0P_EFM->FRMC, EFM_FRMC_CRST0);
    }
    else
    {
        CLEAR_REG32_BIT(M0P_EFM->FRMC, EFM_FRMC_CRST0);
    }
}

/**
 * @brief  Enable or disable the flash instruction cache.
 * @param  [in] enNewState                The new state of the flash instruction cache.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_InstructionCacheCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(M0P_EFM->FRMC, EFM_FRMC_PREFETE);
    }
    else
    {
        CLEAR_REG32_BIT(M0P_EFM->FRMC, EFM_FRMC_PREFETE);
    }
}

/**
 * @brief  Enable or disable the flash data cache.
 * @param  [in] enNewState                The new state of the flash data cache.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_CacheCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(M0P_EFM->FRMC, EFM_FRMC_CACHE);
    }
    else
    {
        CLEAR_REG32_BIT(M0P_EFM->FRMC, EFM_FRMC_CACHE);
    }
}

/**
 * @brief  Checks whether the specified FLASH flag is set or not..
 * @param  [in] u32PeMode                Specifies the FLASH flag to check.
 *  This parameter can be one of the following values:
 *   @arg  EFM_MODE_PROGRAMSINGLE           Program single at a specified address
 *   @arg  EFM_MODE_PROGRAMREADBACK         Program and read back at a specified address
 *   @arg  EFM_MODE_PROGRAMSEQUENCE         Program sequence at sequence address
 *   @arg  EFM_MODE_ERASESECTOR             Sector erase
 *   @arg  EFM_MODE_ERASECHIP               Chip erase
 *   @arg  EFM_MODE_READONLY                Read only
 *   @arg  EFM_MODE_READONLY1               Read only
 *   @arg  EFM_MODE_READONLY2               Read only
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_SetOperateMode(uint32_t u32PeMode)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0;

    DDL_ASSERT(IS_VALID_EFM_OPERATE_MD(u32PeMode));

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }
    if(Ok == enRet)
    {
        /* Enable operate mode modified. */
        SET_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);
        /* Set the program or erase mode. */
        MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_PEMOD, u32PeMode);
        /* Disable operate mode modified. */
        CLEAR_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);
    }
    return enRet;
}

/**
 * @brief  Enable or Disable EFM interrupt.
 * @param  [in] u32EfmInt               Specifies the FLASH flag to check.
 *  This parameter can be one of the following values:
 *   @arg  EFM_INT_EOP                  End of EFM Operation Interrupt source
 *   @arg  EFM_INT_PEERR                Program/erase error Interrupt source
 *   @arg  EFM_INT_RDCOLERR             Read collide error Interrupt source
 *   @arg  EFM_INT_EOP_PEERR            End of EFM Operation and Program/erase error Interrupt
 *   @arg  EFM_INT_EOP_RDCOLERR         End of EFM Operation and Read collide error Interrupt
 *   @arg  EFM_INT_PEERR_RDCOLERR       Program/erase error and Read collide error Interrupt
 *   @arg  EFM_INT_ALL                  All Interrupt source
 * @param  [in] enNewState              The new state of specified interrupt.
 *  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_InterruptCmd(uint32_t u32EfmInt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_VALID_EFM_INT_SEL(u32EfmInt));

    if(Enable == enNewState)
    {
        SET_REG32_BIT(M0P_EFM->FITE, u32EfmInt);
    }
    else
    {
        CLEAR_REG32_BIT(M0P_EFM->FITE, u32EfmInt);
    }
}

/**
 * @brief  Checks whether the specified FLASH flag is set or not.
 * @param  [in] u32flag                  Specifies the FLASH flag to check.
 *  This parameter can be one of the following values:
 *   @arg  EFM_FLAG_PEWERR               Flash wirte protect error flag.
 *   @arg  EFM_FLAG_PEPRTERR             Flash program protect area error flag.
 *   @arg  EFM_FLAG_PGMISMTCHERR         Flash program miss match flag.
 *   @arg  EFM_FLAG_OPTEND               Flash end of program flag.
 *   @arg  EFM_FLAG_COLERR               Flash read write error flag.
 *   @arg  EFM_FLAG_RDY                  Flash ready flag.
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Interrupt flag is set
 *           - Reset: Interrupt flag is reset
 */
en_flag_status_t EFM_GetFlagStatus(uint32_t u32flag)
{
    DDL_ASSERT(IS_VALID_EFM_FLAG(u32flag));

    return ((0ul == (M0P_EFM->FSR & u32flag)) ? Reset :Set);
}

/**
 * @brief  Clear the flash flag.
 * @param  [in] u32flag                  Specifies the FLASH flag to clear.
 *  This parameter can be one of the following values:
 *   @arg  EFM_FLAG_CLR_PEWERRCLR        Flash wirte protect error flag.
 *   @arg  EFM_FLAG_CLR_PEPRTERRCLR      Flash program protect area error flag.
 *   @arg  EFM_FLAG_CLR_PGMISMTCHCLR     Flash program miss match flag.
 *   @arg  EFM_FLAG_CLR_OPTENDCLR        Flash end of program flag.
 *   @arg  EFM_FLAG_CLR_COLERRCLR         Flash read write error flag.
 * @retval None
 */
void EFM_ClearFlag(uint32_t u32flag)
{
    SET_REG32_BIT(M0P_EFM->FSCLR, u32flag);
}

/**
 * @brief  Set flash protect area.
 * @param  [in] stcAddr                  Specifies the FLASH protect area.
 *   @arg  u32StartAddr                     Start address of protect area.
 *   @arg  u32EndAddr                       End address of protect area.
 * @retval None
 */
void EFM_SetWinProtectAddr(stc_efm_win_protect_addr_t stcAddr)
{
    /* Set protect area start address */
    MODIFY_REG32(M0P_EFM->FPMTSW, EFM_FPMTSW_FPMTSW, stcAddr.u32StartAddr);
    /* Set protect area end address */
    MODIFY_REG32(M0P_EFM->FPMTEW, EFM_FPMTEW_FPMTEW, stcAddr.u32EndAddr);
}

/**
 * @brief  Set bus state while flash program or erase.
 * @param  [in] u32State                  Specifies the new bus state while flash program or erase.
 *  This parameter can be one of the following values:
 *   @arg  EFM_BUS_BUSY                   Bus busy while flash program or erase.
 *   @arg  EFM_BUS_RELEASE                Bus releas while flash program or erase.
 * @retval None
 */
void EFM_SetBusState(uint32_t u32State)
{
    DDL_ASSERT(IS_VALID_EFM_BUS_STATE(u32State));

    MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_BUSHLDCTL, u32State);
}

/**
 * @brief  Flash single program word without read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u32Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_ProgramWord(uint32_t u32Addr, uint32_t u32Data)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Enable operate mode modified. */
    SET_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);
    /* Set single program mode. */
    MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_PROGRAMSINGLE);
    /* program data. */
    *(uint32_t*)u32Addr = u32Data;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }

    if(u32Data != *(uint32_t*)u32Addr)
    {
        enRet = Error;
    }

    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    /* Set read only mode. */
    MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
    /* Disable operate mode modified. */
    CLEAR_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);

    return enRet;
}

/**
 * @brief  Flash single program half word without read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u16Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_ProgramHalfWord(uint32_t u32Addr, uint16_t u16Data)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Enable operate mode modified. */
    SET_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);
    /* Set single program mode. */
    MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_PROGRAMSINGLE);
    /* program data. */
    *((volatile uint16_t*)u32Addr) = u16Data;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }

    if(u16Data != *((volatile uint16_t*)u32Addr))
    {
        enRet = Error;
    }

    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    /* Set read only mode. */
    MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
    /* Disable operate mode modified. */
    CLEAR_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);

    return enRet;
}

/**
 * @brief  Flash single program byte without read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u8Data                    The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_ProgramByte(uint32_t u32Addr, uint8_t u8Data)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Enable operate mode modified. */
    SET_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);
    /* Set single program mode. */
    MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_PROGRAMSINGLE);
    /* program data. */
    *((volatile uint8_t*)u32Addr) = u8Data;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }

