hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_efm.c
    u16tmp = 0u;
    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
        }
    }
    /* CLear the end of operate flag */
    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);

    return enRet;
}

/**
 * @brief  Flash sector erase.
 * @param  [in] u32Addr                   The uncertain(random) address in the specified sector.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - ErrorTimeout: program error timeout
 * @note   The address should be word align.
 */
en_result_t EFM_SectorErase(uint32_t u32Addr)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Enable operate mode modified. */
    SET_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);
    /* Set sector erase  mode. */
    MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_ERASESECTOR);

    *(uint32_t*)u32Addr = 0ul;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }
    /* CLear the end of operate flag */
    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    /* Set read only mode. */
    MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
    /* Disable operate mode modified. */
    CLEAR_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);

    return enRet;
}

/**
 * @brief  Flash chip erase.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - ErrorTimeout: program error timeout
 * @note   The address should be word align.
 */
en_result_t EFM_ChipErase(void)
{
    en_result_t enRet = Ok;
    uint16_t u16tmp = 0u;

    /* CLear the error flag. */
    EFM_ClearFlag(EFM_FLAG_CLR_PEWERRCLR    | EFM_FLAG_CLR_PEPRTERRCLR |
                  EFM_FLAG_CLR_PGMISMTCHCLR | EFM_FLAG_CLR_OPTENDCLR   |
                  EFM_FLAG_CLR_COLERRCLR);

    /* Enable operate mode modified. */
    SET_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);
    /* Set chip erase  mode. */
    MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_ERASECHIP);

    *(uint32_t*)0 = 0ul;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u16tmp ++;
        if(u16tmp > EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }
    /* CLear the end of operate flag */
    EFM_ClearFlag(EFM_FLAG_CLR_OPTENDCLR);
    /* Set read only mode. */
    MODIFY_REG32(M0P_EFM->FWMC, EFM_FWMC_PEMOD, EFM_MODE_READONLY);
    /* Disable operate mode modified. */
    CLEAR_REG32_BIT(M0P_EFM->FWMC, EFM_FWMC_PEMODE);

    return enRet;
}

/**
 * @brief  Read unique ID.
 * @param  None
 * @retval An stc_efm_unique_id_t structure value:
 *           - uniqueID0: unique ID 0
 *           - uniqueID1: unique ID 1
 *           - uniqueID2: unique ID 2
 */
stc_efm_unique_id_t EFM_ReadUID(void)
{
    stc_efm_unique_id_t stcUID;

    stcUID.u32UniqueID0 = M0P_EFM->UQID0;
    stcUID.u32UniqueID1 = M0P_EFM->UQID1;
    stcUID.u32UniqueID2 = M0P_EFM->UQID2;

    return stcUID;
}

/**
 * @}
 */

#endif  /* DDL_EFM_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
